---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.LineArcTangentFailure
source: html/ae24131b-cefa-6071-a52c-b88148deaf01.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.LineArcTangentFailure Property

Can't keep arc element and straight line element tangent.

## Syntax (C#)
```csharp
public static FailureDefinitionId LineArcTangentFailure { get; }
```